Repository: mathcret/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/activity_sheets/*_gallery.po
Languages: as

source: Lesson plan 1: Glacier Gallery
as: Cours n°1 : la Galerie des Glaciers

source: Author
as: Auteur

source: Grades
as: Niveau

source: High school students
as: Lycéens

source: Brief Description
as: Brève description

source: Utilizing the interactive app :ref:`gallery` provided by OGGM-Edu, students will be introduced to glaciers and their forms.
as: En utilisant l'application interactive :ref:`gallery` fournie par OGGM-Edu, les élèves seront familiarisés avec les glaciers et leurs formes.

source: Objectives
as: Objectifs

source: Upon completion of this lesson, students will be able to:
as: A l'issue de cette leçon, les élèves seront capables de :

source: Identify the standard definition of a glacier
as: Donner la définition standard d'un glacier

source: Compare and contrast the four glacier types presented in the app
as: Comparer et confronter les quatre types de glaciers présentés dans l'application.

source: Materials Needed
as: Matériel nécessaire

source: Computer with access to OGGM-Edu (possibly one computer per group of 2 or 3)
as: Ordinateur avec un accès à OGGM-Edu (éventuellement un ordinateur par groupe de 2 ou 3)

source: A writing utensil and paper
as: Une feuille et de quoi écrire

source: Lesson Plan
as: Plan du cours

source: Brainstorm with students to discern what they know about glaciers. This could entail asking students to individually write down their initial definition of a glacier, or collaboratively create a mind-map that lists the characteristics of a glacier.
as: Brainstormez avec les élèves pour déterminer ce qu'ils savent sur les glaciers. Cela pourrait consister à demander aux élèves de noter individuellement leur définition initiale d'un glacier, ou de créer en collaboration une carte mentale qui liste les caractéristiques d'un glacier.

source: Open the Glacier Gallery app and highlight the definition of a glacier defined by OGGM-Edu. Emphasize that a glacier is a perennial land-mass of ice, and highlight the differences between the student-provided definition against the OGGM-Edu provided definition of a glacier.
as: Ouvrez l'application Galerie des Glaciers (Glacier Gallery) et mettez en évidence la définition d'un glacier telle qu'elle est donnée par OGGM-Edu. Insistez sur le fait qu'un glacier est une masse de glace terrestre et pérenne, et mettez en évidence les différences entre la définition fournie par l'élève par rapport à celle fournie par l'OGGM-Edu.

source: Provide short instruction on how to use the Glacier Gallery. Ask students to independently (either alone or in small groups) to create a visual representation of the similarities and differences between the four glacier types on a piece of paper. Provide a short period of allotted time to work and occasionally offer your assistance when asked or needed.
as: Donnez de brèves instructions sur la façon d'utiliser la Galerie des Glaciers. Demandez aux élèves de créer de manière autonome (seuls ou en petits groupes) une représentation visuelle des similitudes et des différences entre les quatre types de glaciers sur une feuille. Accordez-leur une courte période de temps pour travailler et offrez occasionnellement votre aide lorsqu'elle est demandée ou nécessaire.

source: If not rushed for time, ask students to individually present their findings. Otherwise, create your own compare-and-contrast visualization method and use student-input to fill it in.
as: Si vous n'êtes pas pressé par le temps, demandez aux élèves de présenter individuellement leurs résultats. Sinon, créez votre propre méthode de mise en évidence des différences et utilisez les contributions des élèves pour la compléter.

source: Summarize the key differences between the four glacier types in a method that would allow students to take notes.
as: Résumez les principales différences entre les quatre types de glaciers d'une manière qui permettrait aux étudiants de prendre des notes.

source: For the remainder of the lesson, ask students to ask questions.
as: Pour le reste de la leçon, demandez aux élèves de poser leurs questions.
