Repository: mathcret/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/activity_sheets/*_simulator.po
Languages: as

source: Lesson plan 3: Glacier Simulator
as: Cours n°3 : Le Simulateur de Glacier

source: Author
as: Auteur

source: Grades
as: Niveau

source: High school students
as: Lycéens

source: Brief Description
as: Courte description

source: Utilizing the interactive app :ref:`simulator` provided by OGGM-Edu, students will learn how glaciers flow, grow, shrink, as well as what parameters influence glacier size, and more.
as: En utilisant l'application interactive :ref:`simulator` fournie par OGGM-Edu, les élèves apprendront comment les glaciers s'écoulent, croissent, régressent, ainsi que les paramètres qui influencent la taille des glaciers, et plus encore.

source: Objectives
as: Objectifs

source: Upon completion of this lesson, students will be able to:
as: A l'issue de cette leçon, les étudiants seront capables de :

source: Recite and understand words and their definitions, most notably: Equilibrium Line Altitude (ELA), accumulation area, and glacier-mass balance.
as: Comprendre et réciter des mots-clés et leurs définitions, comme : Ligne d'Equilibre (ELA pour Equilibrium Line Altitude), zone d'accumulation, et bilan de masse du glacier.

source: Describe the correlation between glacier top width and accumulation area, ELA and equilibrium glacier size, and glacier density and gradient.
as: Décrire la corrélation entre la largeur du sommet du glacier et la surface de sa zone d'accumulation ; entre l'altitude de la ligne d'équilibre et la taille du glacier à l'équilibre ; entre la densité d'un glacier et son gradient.

source: Discover through scientific inquiry and analysis of visual data
as: Faire des découvertes via une enquête scientifique et l'analyse de données visuelles

source: Materials Needed
as: Matériel nécessaire

source: Computer with access to OGGM-Edu (possibly one computer per group of 2 or 3)
as: Un ordinateur ayant accès à OGGM-Edu (éventuellement un ordinateur par groupe de 2 ou 3)

source: A writing utensil and paper
as: Une feuille et de quoi écrire

source: A teacher-computer to present slides to students
as: Un ordinateur pour l'enseignant afin qu'il présente les diapositives aux élèves

source: Lesson Plan
as: Plan du cours

source: Use the OGGM-Edu provided :ref:`glacier_basics` graphics to visually present the key concepts to students that will be reinforced with the interactive app. Allow students to take notes, but remind them these concepts will be reinforced in the interactive app. The `AntarcticGlaciers: mass-balance <http://www.antarcticglaciers.org/glacier-processes/mass-balance/introduction-glacier-mass-balance/>`_ webpage has information that could be used to verbally aid the instructor on the fundamentals or be used as a supplement for students.
as: Utilisez les graphiques fournis par OGGM-Edu :ref:`glacier_basics` pour présenter visuellement aux élèves les concepts clés qui seront approfondis grâce à l'application interactive. Laissez les élèves de prendre des notes, mais rappelez-leur que ces concepts seront approfondis dans l'application interactive. La page web `AntarcticGlaciers : bilan de masse <http://www.antarcticglaciers.org/glacier-processes/mass-balance/introduction-glacier-mass-balance/>`_ contient des informations qui pourraient être utiles pour aider l'instructeur sur les principes de base ou être utilisées comme un supplément pour les étudiants.

source: Either provide short instructions on how to use Glacier Simulator, or allow students (in small groups or individually) to guide themselves through the beginner tutorial within the program. Afterwards leave an allotted time for student questions on how to use the app.
as: Vous pouvez au choix : fournir de brèves instructions sur l'utilisation du Simulateur de Glacier, ou bien permettre aux élèves (en petits groupes ou individuellement) de se laisser guider par le tutoriel pour débutants disponible dans le programme. Laissez ensuite un un temps pour les questions des élèves concernant l'utilisation de l'application.

source: Either project on a board, or print out and pass, instructions that will guide students through the three self-contained inquiries. The instructions for the first inquiry are as follows:
as: Projetez sur un tableau ou imprimez et faites passer des instructions qui guideront les élèves à travers les trois questions autonomes. Les instructions pour la première question sont les suivantes :

source: In beginner mode, set the ELA to 3000m a.s.l and note the equilibrium volume of the glacier, its length, and maximal thickness.
as: En mode débutant, réglez la RLE à 3000 m d'altitude et notez le volume d'équilibre volume du glacier, sa longueur et son épaisseur maximale.

source: Choose the “wider top” glacier shape and run the model again. Is the new glacier larger or smaller? Why do you think so?
as: Choisissez la forme de glacier "à sommet plus large" (*Wider top*) et relancez le modèle. Le nouveau glacier est-il plus grand ou plus petit ? Pourquoi ?

source: Allow students to independently work through the first experiment and offer guidance when prompted or needed.
as: Laissez les élèves travailler en autonomie sur la première expérience et distillez des conseils lorsque cela est nécessaire.

source: When all students are finished, or time commands, ask students for their answer to the questions posed in the last instruction. Emphasize the positive correlation between glacier top width and larger accumulation areas.
as: Lorsque tous les élèves ont terminé, ou que l'horaire le commande, demandez aux élèves leur réponse aux questions posées à la suite de la dernière instruction. Insistez sur la corrélation positive entre la largeur du sommet du glacier et une plus grande

source: Allow students to independently work through the second inquiry and offer guidance when prompted or needed. The instructions follow:
as: Permettez aux élèves de travailler en autonomie sur la deuxième question et donnez des conseils lorsque cela est demandé ou nécessaire. Les instructions sont les suivantes :

source: In beginner mode, set the ELA to 2500m a.s.l and note the equilibrium volume of the glacier, it’s length, and maximal thickness.
as: En mode débutant, fixez la lige d'équilibre à 2500m d'altitude et notez le volume du glacier à l'équilibre, sa longueur et son épaisseur maximale.

source: Change the ELA up to 3500m a.s.l in 200m increments and record, at every increment, the equilibrium volume of the glacier, it’s length, and maximal thickness.
as: Augmentez l'altitude de la ligne d'équilibre jusqu'à 3500 m par pas de 200 m et enregistrez, à chaque incrément, le volume du glacier à l'équilibre, sa longueur et l'épaisseur maximale.

source: Draw these variables on a graph, as a function of the ELA. How does glacier volume change with ELA? Can you explain why? What about glacier length and thickness? Are these changes linear, or more complex?
as: Rprésentez ces variables sur un graphique, en fonction de la ELA. Comment le volume des glaciers change-t-il en fonction de la ELA ? Pouvez-vous expliquer pourquoi ? Qu'en est-il de leur longueur et leur épaisseur ? Ces changements sont-ils linéaires, ou plus complexes ?

source: When all students are finished, or time commands, ask students to either present their graphs, or create your own graph with student input. Highlight the nonlinear relationships between ELA and length, volume, and maximal thickness. Emphasize the negative relationship between ELA and equilibrium glacier size.
as: Lorsque tous les élèves ont terminé, ou lorsque l'horaire l'impose, demandez aux élèves de présenter leurs graphiques, ou créez votre propre graphique avec les données des élèves. Mettez en évidence les relations non linéaires entre la ELA et la longueur, le volume et l'épaisseur maximale. Insistez sur la corrélation négative entre la ELA et la taille du glacier à l'équilibre.

source: Quickly introduce students to the concept of glacier flow. The `AntarcticGlaciers: glacier flow <http://www.antarcticglaciers.org/glacier-processes/glacier-flow-2/glacier-flow>`_ webpage can be used as an aid. For a visual representation of the gravitational force, present to students the `free body on an inclined plane illustration <https://en.wikipedia.org/wiki/Inclined_plane#/media/File:Free_body1.3.svg>`_. Allow students to independently work for an allotted period of time and follow the instructions:
as: Présentez rapidement aux élèves le concept d'écoulement des glaciers. La page web `AntarcticGlaciers : l'écoulement d'un glacier (glacier flow) <http://www.antarcticglaciers.org/glacier-processes/glacier-flow-2/glacier-flow>`_ peut être servir d'aide. Pour une représentation graphique de la force gravitationnelle, présentez aux étudiants l'illustration `"corps libre sur un plan incliné" (free body on an inclined plane) <https://en.wikipedia.org/wiki/Inclined_plane#/media/File:Free_body1.3.svg>`_. Laissez les élèves travailler de manière autonome pendant un temps imparti et suivre les instructions suivantes :

source: Use beginner mode with standard settings (constant width, mass balance gradient of 4 and ELA of 3000) and run the model with each setting for the slope and use the geometry plot for inspection. Take notes on a piece of paper of the ice thickness, volume, area and length at the end of each model run.
as: Utilisez le mode débutant avec les paramètres standard (largeur constante, gradient de bilan massique égal à 4 et ELA fixée à 3000m) et exécutez le modèle avec chaque paramètre disponible pour la pente. Utilisez le tracé géométrique (geometry plot) pour contrôler ce qui se passe. Notez l'épaisseur, le volume, la surface et la longueur du glacier à la fin de chaque exécution du modèle.

source: Using your analytical skills, answer the following questions. Which glaciers are thicker: steep or flat ones? Why?
as: En utilisant vos capacités d'analyse, répondez aux questions suivantes. Quels glaciers sont les plus épais : les glaciers de forte pente ou les glaciers plats ? Pourquoi ?

source: When all students are finished, or time commands, ask students for their answer to the questions posed in the last instruction. Correct students on their mistakes, and allow students to reiterate the concept that the steeper the slope, the thinner the glacier.
as: Lorsque tous les élèves ont terminé, ou que l'horaire le commande, demandez aux élèves leur réponse aux questions posées à la suite des dernières instructions. Corrigez leurs erreurs, et laissez les élèves réitérer le concept suivant : plus la pente est raide, plus le glacier est mince.

source: Use the remainder of the lesson to answer any questions students may have. Direct them to the supplementary sources listed in this document for further investigation or reinforcement of concepts.
as: Utilisez le temps qu'il vous reste pour répondre à toutes les questions que les élèves peuvent se poser. Orientez-les vers les ressources complémentaires énumérées dans ce document pour approfondir ou renforcer des concepts.
