Repository: mathcret/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/glacier_basics.po
Languages: fr

source: Introduction to glaciers
fr: "Introduction aux glaciers"

source: A collection of free glacier graphics that can be used for education and outreach.
fr: Une collection de graphiques sur les glaciers qui peuvent être utilisés librement à des fins

source: **License**: `Creative Commons Attribution-ShareAlike 4.0 International License <https://creativecommons.org/licenses/by-sa/4.0/>`_
fr: **Licence**: `Creative Commons Attribution-ShareAlike 4.0 International License <https://creativecommons.org/licenses/by-sa/4.0/>`_

source: Feel free to use / adapt the graphics, but always refer to the original author and share them with a compatible license.
fr: N'hésitez pas à utiliser / adapter les graphiques, mais faites toujours référence à l'auteur original et partagez-les avec une licence appropriée.

source: **Author**: Anne Maussion, `Atelier les Gros yeux <http://atelierlesgrosyeux.com>`_
fr: **Auteur**: Anne Maussion, `Atelier les Gros yeux <http://atelierlesgrosyeux.com>`_

source: This series of graphics was designed for a talk given by `Fabien Maussion <https://fabienmaussion.info/>`_ to a general audience. He used them to explain the concepts of accumulation, ablation, equilibrium line altitude and mass movements in a glacier.
fr: Cette série de graphiques a été conçue pour une conférence grand public donnée par `Fabien Maussion <https://fabienmaussion.info/>`_ . Il les a utilisés pour expliquer les concepts d'accumulation, d'ablation, de ligne d'équilibre ainsi que les mouvements de masse dans un glacier.

source: **Download**: `zip file <https://github.com/OGGM/glacier-graphics/blob/master/glacier_intro/glacier_intro.zip?raw=true>`_, `gif <https://raw.githubusercontent.com/OGGM/glacier-graphics/master/glacier_intro/gif/glacier.gif>`_
fr: **Télécharger**: `zip file <https://github.com/OGGM/glacier-graphics/blob/master/glacier_intro/glacier_intro.zip?raw=true>`_, `gif <https://raw.githubusercontent.com/OGGM/glacier-graphics/master/glacier_intro/gif/glacier.gif>`_

source: Single images with explanations
fr: Explication des images une à une

source: The first image just sets the scene and allows to explain that we are now looking at a typical mountain glacier from a cross-section along the main ice flow.
fr: La première image plante le décor et permet d'expliquer ce que nous regardons : un glacier de montagne typique, vu en coupe transversale le long du flux de glace principal.

source: We then announce that we are looking at the processes at the glacier surface first. This helps to bring the focus to it first.
fr: Nous signalons ensuite que nous étudions les processus à la surface du glacier,pour attirer l'attention sur elle dans un premier temps.

source: **Accumulation**: definition, which processes are at play, how you measure it, typical values... The time you want to spend on it is up to you. Note that some snow flakes now appears on the upper left corner!
fr: **Accumulation** : définition, quels processus sont en jeu, comment on la mesure, les valeurs courantes... Le temps que vous voulez y consacrer dépend de vous. Notez que quelques flocons de neige apparaissent maintenant dans le coin supérieur gauche !

source: **Ablation**: definition, which processes are at play, how you measure it, typical values... The time you want to spend on it is up to you. Note that a sun now appears on the upper right corner!
fr: **Ablation** : définition, quels sont les processus en jeu, comment on les mesure , valeurs usuelles... Le temps que vous voulez y consacrer ne dépend que de vous. Notez qu'un soleil apparaît maintenant dans le coin supérieur droit !

source: **Mass Balance**: definition, over which period you measure it, typical values... The time you want to spend on it is up to you. Note that the formula is now complete!
fr: **Bilan de masse** : définition, période sur laquelle on le mesure, valeurs typiques ... Vous êtes libres de choisir le temps que vous voulez y consacrer. Notez que la formule est maintenant complète !

source: The imbalance between accumulation and ablation is compensated by a **movement of ice** from top to bottom. If this is where you want to bring your talk to, you can use the mass flux arrow to explain the principles of ice thickness inversion using mass conservation principles.
fr: Le déséquilibre entre l'accumulation et l'ablation est compensé par un **mouvement de la glace** de l'amont vers l'aval. Si ce dont vous voulez parler, vous pouvez utiliser la flèche du flux de masse pour expliquer les principes de l'inversion de l'épaisseur de la glace en utilisant les principes de conservation de la masse.

source: Concept of **Equilibrium Line Altitude** (ELA).
fr: Le concept de **Ligne d'Equilibre Glaciaire** (LEG)

source: More accumulation and/or less ablation leads to a **decrease** of the ELA. You might want to highlight the changes in surface mass budget as well as the increased solid precipitation and/or the shaded sun.
fr: Plus d'accumulation et/ou moins d'ablation conduit à un **abaissement** de la LEG. Vous pourriez vouloir souligner les changements dans le bilan de masse surfaciqueainsi que l'augmentation des précipitations solides et/ou l'ombre du soleil.

source: This new imbalance increases the flux of ice through the glacier (hence the wider arrow) and results in a glacier advance. See the response time section below for a companion graphic.
fr: Ce nouveau déséquilibre augmente le flux de glace le long du glacier (d'où la flèche plus large) et entraîne une avancée du glacier. Se référer à la rubrique "temps de réponse" ci-dessous pour un graphique complémentaire.

source: Less accumulation and/or more ablation leads to an **increase** of the ELA. You might want to highlight the changes in surface mass budget as well as the decreased solid precipitation and/or the stronger sun.
fr: Moins d'accumulation et/ou plus d'ablation conduit à une **élévation** de la LEG. Vous pourriez vouloir mettre en évidence les modifications du bilan de masse surfacique ainsi que la diminution des précipitations solides et/ou le soleil plus fort.

source: This new imbalance decreases the flux of ice through the glacier (hence the thinner arrow) and results in a glacier retreat. See :ref:`glacier_lowpass` for a companion graphic.
fr: Ce nouveau déséquilibre diminue le flux de glace le long du glacier (d'où la flèche plus fine) et entraîne un recul du glacier. Voir :ref:`glacier_lowpass` pour avoir un graphique explicatif de plus.
