Repository: mathcret/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: fr

source: Interactive apps
fr: Applications interactives

source: Graphics
fr: Graphiques

source: OGGM-Edu notebooks
fr: Notebooks OGGM-Edu

source: Interactive Notebooks
fr: Notebooks interactifs

source: OGGM tutorials
fr: Tutoriels OGGM

source: For instructors and teachers
fr: Vous êtes formateur ou enseignant ?

source: Welcome to OGGM-Edu!
fr: Bienvenue sur OGGM-Edu !

source: OGGM-Edu is an educational website about glaciers.
fr: OGGM-Edu est un site web éducatif sur les glaciers.

source: Our main goal is to **provide tools and materials for instructors** who want to teach about glaciers at school, in workshops or at the university.
fr: Notre objectif principal est de **fournir des outils et du contenu aux formateurs** qui souhaitent enseigner les glaciers à l'école, dans des ateliers ou à l'université.

source: For a general introduction and an overview, visit this recent `EGU cryoblog post <https://blogs.egu.eu/divisions/cr/2021/03/12/do-you-know-about-oggm-edu-an-open-source-educational-platform-about-glaciers-and-glacier-modelling/>`_!
fr: Pour une introduction générale et une vue d'ensemble, vous pouvez consulterce billet récent : `EGU cryoblog <https://blogs.egu.eu/divisions/cr/2021/03/12/do-you-know-about-oggm-edu-an-open-source-educational-platform-about-glaciers-and-glacier-modelling/>`_!

source: **OGGM-Edu has four independent and complementary components**:
fr: **OGGM-Edu est fait de quatre composantes indépendantes et complémentaires** :

source: :ref:`title_apps`, to illustrate glaciological processes with the help of interactive graphics on the web. The targeted audience is very broad, from school children to adults, with or without scientific background.
fr: :ref:`title_apps`, pour illustrer les processus glaciologiques grâce à desgraphiques interactifs en ligne. Le public ciblé est très large, allant des écoliers aux adultes, avec ou sans formation scientifique.

source: :ref:`title_graphics`, open access images and graphics that can be used for lectures or presentations.
fr: :ref:`title_graphics`, des images et des graphiques en libre accès qui peuvent être utilisés pour des cours ou des présentations.

source: :ref:`title_notebooks`, for students willing to run and develop their own experiments. The targeted audience are students at the undergrad or graduate level with some programming experience, or under the supervision of an instructor who can show them how to run the experiments.
fr: :ref:`title_notebooks`, pour les étudiants désireux de mener et développer leurs propres : expériences. Le public visé est constitué d'étudiants de premier cycle universitaire ou diplômés ayant une certaine expérience de la programmation, ou d'étudiants supervisés par un instructeur capable de leur montrer comment mener à bien les expériences.

source: :ref:`title_tuto`, for current and future users of the Open Global Glacier Model. These notebooks are targetting graduate students or scientists aiming to learn how the model works.
fr: :ref:`title_tuto`, pour les utilisateurs actuels et futurs de l'"Open Global Glacier Model". Ces notebooks sont destinés aux étudiants diplômés ou aux

source: OGGM-Edu focuses on interactive content and numerical glacier experiments. We do not provide teaching resources about fundamentals in glaciology or climate science: for fundamental textbook material, refer to :ref:`other_resources`, which OGGM-Edu intends to complement.
fr: OGGM-Edu se concentre sur le contenu interactif et les expériences numériques sur les glaciers. Nous ne fournissons pas de ressources pédagogiques sur les principes fondamentaux de la glaciologie ou des sciences du climat : pour les manuels fondamentaux, référez-vous à :ref:``other_resources`, que OGGM-Edu entend compléter.

source: These interactive apps can be run on any computer with an internet connection.
fr: Ces applications interactives peuvent être exécutées sur n'importe quel ordinateur disposant d'un accès à Internet.

source: Open access images and graphics that can be used for lectures or presentations.
fr: Des images et des graphiques en libre accès qui peuvent être utilisés

source: Collection of notebooks with simple experiments explaining one or more glaciological concepts. They are relatively easy to follow and adapt with some background in programming, and we are working to make them as accessible as possible. Read our :ref:`notebooks_howto` first if you are new to these things.
fr: Collection de notebooks contenant des expériences simples expliquant un ou plusieurs concepts glaciologiques. Ils sont relativement faciles à suivre et à adapter avec quelques connaissances en programmation, et nous nous efforçons de les rendre aussi accessibles que possible. Lisez d'abord notre :ref:`notebooks_howto` si vous n'êtes pas familier avec ce sujet.

source: These are more advanced notebooks, for users of the OGGM model.
fr: "Vous trouverez ici des notebooks plus avancés, à destination des utilisateurs du modèle OGGM."

source: Thanks for considering OGGM-Edu for your classes! We've gathered some recommendations and guidelines here.
fr: Merci d'avoir songé à OGGM-Edu pour vos cours ! Nous avons rassemblé quelques recommandations et consignes ici.

source: Get in touch
fr: Contactez nous

source: Interested in OGGM-Edu? We would love to hear from you!
fr: Intéressés par OGGM-Edu ? Nous attendons de vos nouvelles !

source: All of this website and notebooks are located `on GitHub`_.
fr: L'ensemble du site comme les notebooks se trouvent `on GitHub`_.

source: Report bugs or share your ideas on the `issue tracker`_.
fr: Signalez les bugs ou partagez vos idées sur le `issue tracker`_.

source: Improve the website by submitting a `pull request`_.
fr: Améliorez le site web en déposant une `pull request`_.

source: Follow us on `Twitter`_.
fr: Suivez nous sur `Twitter`_.

source: Or you can always send us an `e-mail`_ the good old way.
fr: Ou vous pouvez toujours nous envoyer un `e-mail`_ comme au bon vieux temps.

source: Acknowledgements
fr: Remerciements

source: OGGM-Edu is an affiliated project of the larger OGGM consortium (`oggm.org <https://oggm.org>`_). It is mainly the work of volunteers, but we also had support from various sources:
fr: (`oggm.org <https://oggm.org>`_). C'est principalement le travail de volontaires, mais nous avons également bénéficié du soutien d'organisations variées :

source: the University of Innsbruck, Förderkreis **1669** – **Wissen** schafft Gesell **schaft** (2019-2020).
fr: l' Université d'Innsbruck, Förderkreis **1669** – **Wissen** schafft Gesell **schaft** (2019-2020).

source: the German BMBF (project FKZ 01LS1602A, 2017-2019).
fr: le German BMBF (project FKZ 01LS1602A, 2017-2019).

source: `Google Cloud | Data Solutions for Change`_ who provided cloud computing and hosting credits (2019-2020).
fr: `Google Cloud | Data Solutions for Change`_ qui a fourni le "cloud computing" et des crédits d'hébergement (2019-2020).

source: the University of Innsbruck, department of `Digital Sciences <https://www.uibk.ac.at/zid/abteilungen/lt/>`_ (Neue Medien Projekte, 2018).
fr: l' Université d'Innsbruck, et le département des `Digital Sciences <https://www.uibk.ac.at/zid/abteilungen/lt/>`_ (Neue Medien Projekte, 2018).

source: the OGGM e.V. organisation, who supported the creation of the OGGM-Edu logo and of the glacier graphics.
fr: l'organisation OGGM e.V., qui a contribué au graphisme du glacier et à la création du logo OGGM-Edu.

source: We rely on awesome open source tools to run OGGM-Edu! Most notably:
fr: Nous pouvons compter sur des outils open source géniaux pour faire fonctionner OGGM-Edu ! Notamment :

source: and many (many) other packages of the scientific python ecosytem
fr: et de (très) nombreux packages issus de l'écosystème scientifique python

source: Last but not least: thanks to all OGGM-Edu friends and contributors! For a full list, see our `github repository <https://github.com/OGGM/oggm-edu/graphs/contributors>`_.
fr: Last but not least : merci à tous les amis et contributeurs d'OGGM-Edu ! Pour avoir la liste complète, allez voir notre répertoire `github <https://github.com/OGGM/oggm-edu/graphs/contributors>`_.
