Repository: mathcret/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/notebooks_howto.po
Languages: fr

source: Introduction to interactive notebooks
fr: Introduction aux notebooks interactifs

source: If you plan to use OGGM-Edu's educational notebooks (either on your own or in a class), we strongly recommend to read this short information page.
fr: Si vous prévoyez d'utiliser les notebooks pédagogiques de l'OGGM-Edu (que ce soit de façon autonome ou dans une classe), nous vous recommandons vivement de lire cette courte page d'information.

source: Jupyter notebooks
fr: Notebooks Jupyter

source: The `Jupyter Notebook <https://jupyter.org>`_ is an **open-source web application** that allows you to create and share documents that contain **live computer code**, **equations**, **visualizations** and **narrative text**. In OGGM-Edu, we use notebooks to design and share glacier modelling experiments.
fr: Le ` Notebook Jupyter <https://jupyter.org>`_ est une **application web open-source** qui vous permet de créer et de partager des documents contenant **du code informatique dynamique**, **des équations**, **des représentations visuelles** et **du texte narratif**. Dans OGGM-Edu, nous utilisons des notebooks pour concevoir et partager des expériences de modélisationdes glaciers.

source: If you are new to Jupyter Notebooks, don't be scared! You can learn about them and try them out on the `Jupyter website <https://jupyter.org>`_ . We also have prepared a tutorial for you on OGGM-Edu. Open it in your browser with:
fr: Si vous découvrez les Notebooks Jupyter, n'ayez pas peur ! Vous pouvez vous renseigner et les tester sur le site `Jupyter <https://jupyter.org>`_ . Nous avons également préparé un tutoriel pour vous sur OGGM-Edu. Ouvrez-le dans votre navigateur avec :

source: This link will bring you to an interactive :ref:`binder_simple` environment. If you prefer to run the notebooks on your personal computer, you can always download them from our `repository <https://github.com/OGGM/oggm-edu-notebooks>`_ or as a `zip-file <https://github.com/OGGM/oggm-edu-notebooks/archive/master.zip>`_. However, you will have to `install OGGM <https://docs.oggm.org/en/stable/installing-oggm.html>`_ locally for them to work!
fr: Ce lien vous conduira à un environnement interactif :ref:`binder_simple` . Si vous préférez exécuter les notebooks sur votre ordinateur personnel , vous pouvez toujours les télécharger depuis notre `répertoire <https://github.com/OGGM/oggm-edu-notebooks>`_ ou sous forme de `fichier zip <https://github.com/OGGM/oggm-edu-notebooks/archive/master.zip>`_. Cependant, vous devrez `installer OGGM <https://docs.oggm.org/en/stable/installing-oggm.html>`_ en local pour qu'ils fonctionnent !

source: `MyBinder <https://mybinder.org>`_ is a service that allows us to provide online computing environments in which OGGM-Edu notebooks can be read and executed. This is a fantastic service that runs on the cloud - each time a user clicks on an OGGM-Edu binder link, a so-called "virtual machine" is spun-up and made accessible via the web-browser.
fr: `MyBinder <https://mybinder.org>`_ est un service qui nous permet de mettre à disposition des environnements informatiques en ligne dans lesquels les carnets OGGM-Edu peuvent être lus et exécutés. Il s'agit d'un service fantastique qui fonctionne grâce au cloud - chaque fois qu'un utilisateur clique sur le lien d'un notebook OGGM-Edu, une "machine virtuelle" est créée et rendue accessible sur son navigateur.

source: **These binder environments are safe, anonymous, and temporary**. Temporary means non-persistent: if you close the tab in which the environment was opened, it is lost. If you open the link again, a new environment will be created for you, without your previous modifications. Therefore, if you want to save your work for later (i.e. to be able to upload it in a future binder session), don't forget to download the files you modified before leaving (see instructions below). **Be aware that a Binder environment will be shut down after 10 minutes of inactivity** (leaving your tab/window open will count as “activity” only if visible, i.e. leaving the tab open but navigating elsewhere will eventually shut down your session).
fr: **Ces environnements Binder sont sûrs, anonymes et temporaires**. Temporaire signifie qu'ils ne sont pas permanents : si vous fermez l'onglet dans lequel l'environnement a été ouvert, il est perdu. Si vous ouvrez à nouveau le lien, un nouvel environnement sera créé pour vous, sans vos modifications précédentes. Par conséquent, si vous souhaitez sauvegarder votre travail pour plus tard (c'est-à-dire pour pouvoir le télécharger lors d'une prochaine session Binder), n'oubliez pas de télécharger les fichiers que vous avez modifiés avant de partir (voir les instructions ci-dessous). **Sachez qu'un environnement Binder se ferme après 10 minutes d'inactivité** (le fait de laisser l'onglet ouvert ne sera considéré comme une "activité" que si il est visible : laisser l'onglet ouvert mais naviguer ailleurs finira par fermer votre session).

source: MyBinder is a free service provided generously by the Binder and Jupyter communities (`FAQ <https://mybinder.readthedocs.io/en/latest/faq.html>`_). As such, you can expect some waiting time at launch and relatively limited computer resources. However, these resources should be more than enough to run the OGGM-Edu notebooks at home or for a workshop. If needed, we also provide dedicated servers for instructors: see :ref:`technical_details` for more information.
fr: MyBinder est un service gratuit que nous fournissent généreusement les communautés Binder et Jupyter (`FAQ <https://mybinder.readthedocs.io/en/latest/faq.html>`_). En conséquence, vous pouvez vous attendre à un certain temps d'attente au lancement et à des ressources informatiques relativement limitées. Ces ressources devraient tout de même être plus que suffisantes pour exécuter OGGM-Edu à la maison ou lors d'un atelier. Si nécessaire, nous fournissons également des serveurs dédiés pour les formateurs : voir :ref:`technical_details` pour plus d'informations.

source: Starting a MyBinder environment
fr: Lancer un environnement MyBinder

source: After clicking on an OGGM-Edu MyBinder link, you should see a loading page similar to the one below (here with the *show log* button activated):
fr: Après avoir cliqué sur un lien OGGM-Edu MyBinder, vous devriez voir une page de chargement similaire à celle ci-dessous (ici avec le bouton *Afficher le journal (show log)* activé) :

source: A typical binder load page
fr: Page de chargement Binder classique

source: This page indicates that a working OGGM-Edu environment (called an "image") was found on the Binder database and is being started for you. **This image loading can take from a few seconds to a couple of minutes**, depending on the current workload of the service and whether or not the image was already loaded on the virtual machine.
fr: Cette page indique qu'un environnement OGGM-Edu fonctionnel (appelé "image") a été trouvé dans la base de données Binder et est en cours de lancement pour vous. **Le chargement de "l'image" peut prendre de quelques secondes à quelques minutes**, selon la charge de travail actuelle du service et selon que l'image était déjà chargée ou non sur la machine virtuelle.

source: In rare cases, you might encouter a start log with more verbose output, such as this one:
fr: Dans de rares cas, vous pouvez rencontrer un journal de démarrage plus loquace, comme celui-ci :

source: A binder image build log
fr: Exemple de journal pendant le construction de l'*image* Binder

source: This occurs when the image needs to be created anew (refer to :ref:`technical_details` for more information about why this happens). **In these rare cases, the builds can take up to 15 minutes**. Be patient!
fr: Cela se produit lorsque l'image doit être créée à nouveau (reportez-vous à :ref:`technical_details` pour plus d'informations sur la raison pour laquelle cela se produit). **Dans ces rares cas, la création peut prendre jusqu'à 15 minutes**. Soyez patients !

source: Sometimes, the log screen might show an error of the type "Failed to connect to event stream". When this happens, simply refresh your browser (or click on the OGGM-Edu link again)
fr: Parfois, le journal peut afficher une erreur du type : " Échec de la connexion au flux de donnée (Failed to connect to event stream)". Lorsque celase produit, rafraîchissez simplement votre navigateur (ou cliquez à nouveau sur le lien OGGM-Edu)

source: Once the Binder environment is ready, you should see a page similar to this:
fr: Une fois que l'environnement Binder est prêt, vous devriez voir une page similaire à celle-ci :

source: The JupyterLab environment with the three main areas highlighted.
fr: L'environnement JupyterLab avec ses trois zones principales mises en évidence.

source: This is the JupyterLab development environment. It is quite intuitive and most people find their way through it without major struggle, but you might want to have a look at the excellent `documentation <https://jupyterlab.readthedocs.io/en/stable/user/interface.html>`_ as well.
fr: Il s'agit de l'environnement de développement JupyterLab. Il est assez intuitif et la plupart des gens s'y retrouvent sans trop de difficultés, mais vous pourriez aussi bien vouloir jeter un coup d'oeil à l'excellente `documentation <https://jupyterlab.readthedocs.io/en/stable/user/interface.html>`_

source: The three main areas highlighted above are:
fr: Les trois principales zones mises en évidence sont :

source: **Menu Bar** (blue): top-level menus that expose actions available in JupyterLab
fr: **Barre de Menu** (bleu) : menus primaires qui affichent les actions disponibles dans JupyterLab

source: **Left Sidebar** (red): contains a number of commonly-used tabs, such as a file browser (most important), a list of running kernels (i.e.: notebooks) and terminals, the command palette, and a list of tabs in the main work area
fr: **Barre latérale gauche** (rouge) : contient un certain nombre d'onglets couramment utilisés, tels que un explorateur de fichiers (le plus important), une liste des noyaux en cours d'exécution (i.e. notebooks) et des terminaux, la console de commande, et une liste d'onglets dans la zone de travail principale

source: **Main Work Area** (green): the main work area in JupyterLab enables you to arrange documents (notebooks, text files, etc.) and other activities into panels of tabs that can be resized or subdivided. Drag a tab to the center of a tab panel to move the tab to the panel. Subdivide a tab panel by dragging a tab to the left, right, top, or bottom of the panel
fr: **Zone de travail principale** (vert) : la zone de travail principale de JupyterLab vous permet d'organiser des documents (carnets de notes, fichiers texte, etc.) et d'autres activités en panneaux d'onglets qui peuvent être redimensionnés ou subdivisés. Faites glisser un onglet vers le centre d'un panneau d'onglets pour déplacer l'onglet vers le panneau. Subdivisez un panneau d'onglets en faisant glisser un onglet vers la gauche, la droite, le haut ou le bas du panneau

source: Download and upload files to MyBinder/JupyterLab
fr: Téléchargement et chargement de fichiers dans MyBinder/JupyterLab

source: Since your MyBinder environment is temporary, you might find it useful to download the notebooks you modified during your session, and/or upload notebooks or data that you store on your computer.
fr: Puisque votre environnement MyBinder est temporaire, vous pourriez avoir besoin de télécharger les notebooks que vous avez modifiés pendant votre session, et/ou d'uploader des notebooks ou des données que vous stockez sur votre ordinateur.

source: To **download a notebook, use the left sidebar's file explorer**: right-click on the file you'd like to download and select `Download`. You can also download the notebook in various static formats in the menu: `File` → `Export Notebook As` (we recommend ``html``). Be aware that some formats might not export properly.
fr: Pour **télécharger un notebook, utilisez l'explorateur de fichiers dans la barre latérale gauche** : faites un clique droit sur le fichier que vous souhaitez télécharger et sélectionnez "Télécharger". Vous pouvez également télécharger le notebook sous différents formats standards dans le menu : `Fichier` → `Exporter le carnet sous` (nous recommandons ``html``). Sachez que certains formats peuvent ne pas s'exporter correctement.

source: To **upload a file or notebook, use the up-arrow button on the top of the sidebar**: you can upload any file - text or data.
fr: Pour **télécharger un fichier ou un notebook, utilisez le bouton *flèche vers le haut* en haut de la barre latérale** : vous pouvez télécharger n'importe quel fichier - texte ou donnée.

source: The JupyterLab's upload button (red box)
fr: Le bouton *upload* de JupyterLab (cadre rouge)
