Repository: mathcret/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/other_resources.po
Languages: fr

source: Other educational resources
fr: Autres ressources pédagogiques

source: OGGM-Edu tries to follow its goal as provider of interactive content, focusing on numerical glacier models. However, OGGM-Edu does not provide much theoretical background or lecture materials. For more information about fundamentals, check out these great online resources:
fr: OGGM-Edu essaie de jouer son rôle de fournisseur de contenu interactif,en se concentrant sur les modèles numériques de glaciers. Cependant, OGGM-Edu fournit peud'informations théoriques ou de supports de cours. Pour plus d'informations sur les principes fondamentaux, consultez ces excellentes ressources en ligne :

source: `Antarctic Glaciers <http://www.antarcticglaciers.org/>`_: excellent resource to learn about glaciers (and not only those in Antarctica), for students at high school and university level. Probably the most comprehensive online resource available: many of our tutorials refer to pages in Antarctic Glaciers.
fr: `Antarctic Glaciers <http://www.antarcticglaciers.org/>`_ : excellente source d'information sur les glaciers (et pas seulement ceux de l'Antarctique), pour les lycéens et les étudiants à l'université. Probablement la plus complète disponible en ligne : beaucoup de nos tutoriels font référence aux pages dans Antarctic Glaciers.

source: `GlacierHub <https://glacierhub.org>`_: news and stories about glaciers from many disciplines.
fr: `GlacierHub <https://glacierhub.org>`_ : actualités et histoires sur les glaciers en provenance de nombreuses disciplines.

source: `The PROMICE ice school <http://isskolen.dk/wp/?page_id=7477>`_, an e-learning website for children aged 12 to 14, giving a basic introduction to ice and climate change.
fr: `The PROMICE ice school <http://isskolen.dk/wp/?page_id=7477>`_, un site d'apprentissage en ligne pour les enfants âgés de 12 à 14 ans, offrant une première initiation à la cryosphère et au changement climatique.

source: `All about glaciers <https://nsidc.org/cryosphere/glaciers>`_ from NSIDC
fr: `Tout sur les glaciers <https://nsidc.org/cryosphere/glaciers>`_ par le National Snow & Ice Data Center (NSIDC)

source: `GRANTISM <http://homepages.ulb.ac.be/~fpattyn/grantism/>`_, an ice-sheet model written in excel (`online interactive version <http://www.martinoleary.com/jsism>`_)
fr: `GRANTISM <http://homepages.ulb.ac.be/~fpattyn/grantism/>`_, un modèle de calotte glaciaire codé sous Excel (`version interactive en ligne <http://www.martinoleary.com/jsism>`_)

source: Hans Oerlemans's `Minimal Glacier Models <http://www.staff.science.uu.nl/~oerle102/MM2011-all.pdf>`_ book: a strong inspiration for this website
fr: Le livre de Hans Oerlemans `Minimal Glacier Models <http://www.staff.science.uu.nl/~oerle102/MM2011-all.pdf>`_ : une grande source d'inspiration pour ce site.

source: `SwissEduc Glaciers online <https://www.swisseduc.ch/glaciers/>`_: a collection of glacier facts and photos.
fr: `SwissEduc Glaciers online <https://www.swisseduc.ch/glaciers/>`_: une collection de photos de glaciers accompagnées de détails.

source: `World glacier monitoring service <https://wgms.ch/>`_: the reference for glacier observations and monitoring.
fr: `World glacier monitoring service <https://wgms.ch/>`_: la référence pour l'observation et le monitoring des glaciers.

source: :ref:`title_contact` if you'd like to add some more to this list!
fr: :ref:`title_contact` si jamais vous souhaitez compléter cette liste !
