Repository: mathcret/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/roadmap.po
Languages: fr

source: Contribute to OGGM-Edu
fr: Contribuez à OGGM-Edu

source: As of January 2021, the OGGM-Edu platform features:
fr: Depuis janvier 2021, la plateforme OGGM-Edu comporte :

source: 4 interactive web apps
fr: 4 applications web interactives

source: 8 jupyter notebooks templates in various complexity levels
fr: 8 modèles de notebooks jupyter plus ou moins complexes

source: a series of glacier graphics
fr: une série de graphiques sur les glaciers

source: bits of documentation for teachers about how to use the notebooks and MyBinder
fr: de la documentation à destination des enseignants concernant l'utilisation des notebooks et de MyBinder

source: We are proud of simple things, such as the the use of OGGM-Edu for a class in Peru (`blog post <https://oggm.org/2019/12/06/OGGM-Edu-AGU/>`_), or the positive feedback about the web applications and the use of MyBinder as a viable platform to run workshops and tutorials online.
fr: Nous sommes fiers de choses simples, comme l'utilisation d'OGGM-Edu par une classe au Pérou (`blog post <https://oggm.org/2019/12/06/OGGM-Edu-AGU/>`_), ou les retours positifs sur les applications web et l'utilisation de MyBinder comme une plateforme fiable pour organiser des ateliers et des tutoriels en ligne.

source: This is great! But we also see that there is room for improvement, and we would like to use this page to keep track of our goals for the years to come. OGGM-Edu is meant to be a collaborative platform, and we welcome any kind of contribution, from a typo correction to a new fully fledged web app!
fr: C'est formidable ! Mais nous voyons aussi qu'il est possible de faire mieux, et nous aimerions utiliser cette page pour garder une trace de nos objectifs pour les années à venir. OGGM-Edu se veut une plateforme collaborative, et nous accueillons tout type de contribution, allant de la correction d'une faute de frappe à la création d'une nouvelle application web à part entière !

source: **If you want to participate**, here are some pointers to get you started. Thanks so much for your help!
fr: **Si vous voulez participer**, voici quelques conseils pour vous aider à démarrer. Merci d'avance pour votre aide !

source: Help with typos, text, content, etc.
fr: Aidez nous pour les fautes de frappe, le texte, le contenu, etc.

source: Everything on this website is written by volunteers and non-native english speakers. If you find mistakes or things you'd like to change, please do! You can edit each file by following the "suggest edit" button at the top of each page, or send us your modification suggestions per mail!
fr: Tout ce qui se trouve sur ce site est écrit par des bénévoles et des personnes dont l'anglais n'est pasla langue maternelle. Si vous trouvez des erreurs ou des choses que vous aimeriez changer, faites-le ! Vous pouvez éditer chaque fichier en cliquant sur le bouton "suggest edit" en haut de chaque page, ou nous envoyer vos suggestions de modification par mail !

source: If you want to build the OGGM-Edu website locally to see your changes before publishing them online, see `these instructions <https://github.com/OGGM/oggm-edu/blob/master/BUILD_HOWTO.rst>`_.
fr: Si vous voulez compiler le site OGGM-Edu en local pour voir vos changements avant de les publier en ligne, consultez `ces instructions <https://github.com/OGGM/oggm-edu/blob/master/BUILD_HOWTO.rst>`_.

source: Create new content
fr: Créez de nouveaux contenus

source: We welcome any new idea you may have: a new graphic, a new notebook, a new app... You can decide to have it hosted here at edu.oggm.org (:ref:`reach out! <title_contact>`), or you can decide to have it in your own namespace! Follow :ref:`these instructions <user_content>` if you'd rather do the latter.
fr: Nous sommes preneurs de toute nouvelle idée que vous pourriez avoir : un nouveau graphique, un nouveau notebook, une nouvelle application... Vous pouvez décider de la faire héberger ici à edu.oggm.org (:ref:`reach out ! <title_contact>`), ou bien de l'avoir dans votre propre espace de noms (namespace) ! Suivez :ref:`these instructions <user_content>` si vous voulez plutôt opter pour cette dernière option.

source: Prepare activity sheets for schools
fr: Préparez des fiches d'activités pour les écoles

source: Let's face it: right now, OGGM-Edu is of limited use for teachers, who have only little time to prepare their class. It would be very useful to prepare concrete "activity sheets" which explain how to spend one, two, or four hours with OGGM-Edu, at various levels of difficulty and level of detail. Such documents could also live on the website (e.g. in :ref:`examples`) and be updated as people report their experiences with the tool.
fr: Regardons les choses en face : à l'heure actuelle OGGM-Edu est d'une faible utilité pour les enseignants, ceux-ci n'ayant que peu de temps pour préparer leur cours. Il serait donc très utile de préparer des "fiches d'activités" concrètes qui expliquent comment passer une, deux, ou quatre heures sur OGGM-Edu, avec plusieurs niveaux de difficulté et de détail. De tels documents pourraient également être disponibles sur le site web (par exemple dans :ref:`examples`) et être mis à jour au fur et à mesure que les gens racontent leurs expériences avec cet outil.

source: Help translate OGGM-Edu
fr: Aidez nous à translate OGGM-Edu

source: We are seeking to improve the usefulness of OGGM-Edu in non english speaking groups. It is technically easy to do (we already have template -dummy - pages for `german <https://edu.oggm.org/de/latest/>`_, `french <https://edu.oggm.org/fr/latest/>`_ and `spanish <https://edu.oggm.org/es/latest/>`_ and we can easily add any other language): the hard part is to actually *translate* the content and keep the translations up to date ;-).
fr: Nous cherchons à renforcer la pertinence d'OGGM-Edu pour les groupes non anglophones. C'est techniquement facile à faire (nous avons déjà les squelettes de pages pour `l'allemand <https://edu.oggm.org/de/latest/>`_, `le français <https://edu.oggm.org/fr/latest/>`_ et `espagnol <https://edu.oggm.org/es/latest/>`_, et nous pouvons facilement ajouter une autre langue) : le plus dur est de *traduire* le contenu et de garder les traductions à jour ;-)

source: The translation files are located in the `docs/locale <https://github.com/OGGM/oggm-edu/tree/master/docs/locale>`_ folder: these `.po` files are like a dictionary that can be edited with a simple text editor or dedicated tools (e.g. `poedit <https://poedit.net/>`_). See `this file <https://github.com/OGGM/oggm-edu/blob/master/docs/locale/fr/LC_MESSAGES/alps_future.po>`_ for an example.
fr: Les fichiers de traduction sont dans le dossier `docs/locale <https://github.com/OGGM/oggm-edu/tree/master/docs/locale>`_ : ces fichiers `.po` sont comme un dictionnaire qui peut être édité avec un simple éditeur de texte comme avec des outils consacrés (par exemple `poedit <https://poedit.net/>`_). Consultez `ce fichier <https://github.com/OGGM/oggm-edu/blob/master/docs/locale/fr/LC_MESSAGES/alps_future.po>`_ pour avoir un exemple.

source: If you would like to help, grab these files and translate where you can! The translation of even one single page would be very useful. We can provide support and advice with the languages we can read (spanish, french, german).
fr: Si vous voulez aider, emparez-vous de ces fichiers et traduisez ce que vous pouvez ! La traduction d'une seule page serait très utile. Nous pouvons offrir un soutien et des conseils dans les langues que nous pouvons lire (espagnol, français, allemand).

source: Refactoring of the oggm-edu python package
fr: Refactoring du package python oggm-edu

source: This is probably the most involved change.
fr: "C'est sans aucun doute le changement le plus ambitieux".

source: As it is now, oggm-edu relies mostly on the models and syntax provided by the core OGGM. They provides the functionality we need, but at the same time the OGGM numerical models have several issues in the educational context:
fr: Dans sa forme actuelle, oggm-edu s'appuie principalement sur les modèles et la syntaxe fournis par le noyau OGGM. Ils fournissent les fonctionnalités dont nous avons besoin, mais dans le même temps les modèles numériques d'OGGM ont plusieurs défauts lorsqu'ils sont utilisés dans un contexte éducatif :

source: their functionality is tailored for modelers, not students. I.e. certain variables are not available and/or hidden, the syntax is clumsy, optimisations in code make it less readable
fr: leur fonctionnement est adaptée aux modélistes, pas aux étudiants. C'est-à-dire que certaines variables ne sont pas disponibles et/ou cachées, la syntaxe est maladroite et les optimisations du code le rendent moins compréhensible

source: it is very difficult to change things in OGGM itself because of backwards compatibility
fr: il est très difficile de changer des éléments d'OGGM à cause de la rétrocompatibilité

source: it is complex for new users to find the information in the cluttered OGGM namespace
fr: il est délicat pour les nouveaux utilisateurs de trouver l'information dans le désordre de l'espace de noms (namespace) d'OGGM

source: For these reasons, we suggest to **redesign and refactor the OGGM objects in a more user-friendly, intuitive oggm-edu namespace**.
fr: C'est pour cela que nous vous suggérons de **reconcevoir et remanier les objets OGGM dans un espace de noms oggm-edu plus convivial et intuitif**.

source: This will require some thinking, but in short: we should think about (1) how to name things (very hard) and (2) how do we want the new objects to behave.
fr: Cela va demander un peu de réflexion, mais en bref : nous devrions réfléchir à (1) comment nommer chaque chose (très difficile) et (2) comment nous voulons que les nouveaux objets se comportent.

source: The vision is that people have a one stop shop (the OGGM-Edu documentation) to learn about the flowline models and what they can do with them, without having to struggle with OGGM itself. The models will be more expressive, use rich output in the notebooks, with the goal to make using the models more fun, intuitive and quantitative.
fr: La perspective est que les gens disposent d'un guichet unique (la documentation OGGM-Edu documentation) pour se familiariser avec les modèles de flux et ce qu'ils peuvent en faire , sans avoir à batailler avec OGGM lui-même. Les modèles seront plus expressifs, avec une sortie enrichie dans les notebooks, dans le but de rendre l'utilisation des modèles plus amusante, intuitive et quantitative.

source: Website design
fr: Design du site web

source: (less important)
fr: (moins important)

source: ReadTheDocs and Sphinx are great, but they have their limits. If you have web skills and would like to make OGGM-Edu more appealing, :ref:`reach out! <title_contact>`.
fr: ReadTheDocs et Sphinx sont formidables, mais ils ont leurs limites. Si vous avez les compétences et que vous souhaitez rendre OGGM-Edu plus attrayant, :ref:`contactez nous ! <title_contact>`.
