Repository: mathcret/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/simulator.po
Languages: fr

source: Which reaches the equilibrium faster (*Time*)?
fr: Lequel atteint l'équilibre plus rapidement ? (*Time*)

source: How are *Length*, *Area* and *Volume* affected?
fr: Comment sont affectés la *Longueur*, la *Surface* et le *Volume* ?

source: the larger the mass-balance gradient, the larger the accumulation of mass (ice) at the top
fr: plus le gradient de bilan de masse est grand, plus l'accumulation de masse (glace) est importante au sommet du glacier

source: more accumulation leads to a thicker glacier and a larger downslope component of the gravitational force (see the :ref:`glacier_slope` experiment)
fr: plus d'accumulation conduit à un glacier plus épais et à un plus grand poids accordé à la composante de la force gravitationnelle dans le sens de la pente (voir l'expérience :ref:`glacier_slope`)

source: this larger force causes a larger ice flux and a larger ice velocity
fr: cette force plus importante a pour conséquences un flux de glace plus important et plus rapide

source: the larger the ice velocity the faster ice is transported downwards and the faster the equilibrium is reached
fr: plus la vitesse de la glace est grande, plus la glace est transportée rapidement vers le bas et plus l'équilibre est atteint rapidement

source: length and area are not much affected due to the unchanged **linear** mass-balance profile: no matter which gradient is selected, the total ice gain/loss at a certain height is only determined by the distance away from the ELA (e.g. the same amount of mass is accumulated 100 m above the ELA as there is mass ablated 100 m below the ELA, with a constant width)
fr: la longueur et la superficie ne sont que peu affectées en raison du profil **linéaire** du bilan de masse qui reste inchangé : quel que soit le gradient choisi, le gain / la perte totalede glace à une certaine hauteur est uniquement déterminée par la distance à la ligne d'équilibre (par exemple, la masse accumulée 100 m au-dessus de la ELA est égale à la masse ablatée 100 m en dessous de la ELA, avec une largeur constante)

source: whereas the volume is increasing with a increasing mass-balance gradient due to a larger ice thickness
fr: En revanche, le volume augmente avec un gradient de bilan de masse croissant, en raison d'une plus grande épaisseur de glace

source: The AAR is the ratio of the accumulation area (= area above the ELA) to the total glacier area (see `antarcticglaciers.org (mass-balance)`_). In this experiment we will have a look at the equilibrium (or balanced) AAR (AAR-eq) and the transient (or annual) AAR (AAR-t). Let's make some experiments to see what the AAR can tell us about glaciers. For the interpretation of the experiments, note that the total ice gain/loss at a certain elevation equals the mass-balance (black line in top right figure) times the area (i.e., width) at the same elevation. This is important!
fr: L'AAR est le rapport entre la surface d'accumulation (= surface au-dessus de la ELA) et la surface totale du glacier (voir `antarcticglaciers.org (mass-balance)`_). Dans cette expérience, nous allons étudier l'AAR a l'équilibre (AAR-eq) et le AAR transitoire (ou annuel) (AAR-t). Faisons quelques expériences pour voir ce que l'AAR peut nous apprendre sur les glaciers. Pour interpréter le résultat des expériences, il faut noter que le gain/la perte total de glace à une certaine altitude est égale au bilan de masse (ligne noire dans la figure en haut à droite multiplié par la surface (la largeur) à la même altitude. C'est quelque chose d'important !

source: Use "Beginner mode" and conduct runs with *Width* = *Constant* and *Width* = *Wide top, narrow bottom*, and note down the different AAR-eq (*ELA* = 3300, *Mass-balance gradient* = 4, *Slope* = 11°).
fr: Utilisez le "mode débutant" et lancez le simulateur avec *Width* = *Constant* et *Width* = *Wide top, narrow bottom*. Notez sur une feuille les différentes valeurs de AAR-eq obtenues. (*ELA* = 3300, *Mass-balance gradient* = 4, *Slope* = 11°).

source: Conduct experiments with *Constant* width and different mass-balance gradients (e.g. *Mass-balance gradient below ELA* = 4, *Mass-balance gradient above ELA* = 2 and vice versa) in "Advanced mode". Note down the different AAR-eq.
fr: Lancez des expériences avec une largeur *constante* et différents gradients de bilan massique (par exemple, *gradient de bilan de masse en dessous de la ELA* = 4, *gradient de bilan de masse au-dessus de la ELA* = 2 et vice versa) dans le "Mode Avancé". Notez les différents valeurs prises par l'AAR-eq.

source: For *Constant width*, what values of AAR-t (below or above 0.5) do you expect for an
fr: Pour une largeur *constante*, quelles valeurs de AAR-t (inférieures ou supérieures à 0,5) attendez-vous pour un

source: advancing and a retreating glacier? Can you confirm by looking at the AAR during the simulation, or using the timeseries plots.
fr: glacier qui avance et un glacier qui recule ? Pouvez-vous confirmer ceci en regardant l'AAR pendant la simulation, ou en observant les graphiques des séries temporelles (timeseries plots) ?

source: How is AAR-eq changing with a different mass-balance gradients below and above the ELA?
fr: Comment est-ce que l'AAR-eq évolue lorsque le gradient du bilan massique est différent en dessous et au-dessus de la ligne d'équilibre ?

source: What can you conclude from the experiments about real-world glaciers which have a typical AAR-eq
fr: Quelles conclusion pouvez-vous tirer des expériences sur les glaciers réels qui ont un AAR-eq caractéristique

source: between 0.5 and 0.8? (see for example `Hawkins, 1985 <https://www.cambridge.org/core/journals/journal-of-glaciology/article/equilibriumline-altitudes-and-paleoenvironment-in-the-merchants-bay-area-baffin-island-nwt-canada/21991E0893BCCF88D611103F397D73D1>`_)
fr: entre 0,5 et 0,8 ? (voir par exemple `Hawkins, 1985 <https://www.cambridge.org/core/journals/journal-of-glaciology/article/equilibriumline-altitudes-and-paleoenvironment-in-the-merchants-bay-area-baffin-island-nwt-canada/21991E0893BCCF88D611103F397D73D1>`_)

source: In the *Constant width* case and a linear mass-balance, the AAR is around 0.5.The total ice gain/loss at a certain height is only determined by the distance away from the ELA (e.g. the same amount of mass is accumulated 100 m above the ELA as there is mass ablated 100 m below the ELA) and so the glacier area above the ELA equals the glacier area below (approximately).
fr: Dans le cas où la largeur est constante et le bilan de masse linéaire, l'AAR vaut environ 0,5. Le gain/la perte total de glace à une certaine hauteur n'est déterminé que par la distance à la ligne d'équilibre (par exemple, la masse accumulée 100 m au-dessus de la ELA est égale à la masse ablatée 100 m sous la ELA). La surface du glacier au-dessus de la ELA est donc égale à la surface du glacier en dessous (approximativement).

source: In the *Wide top, narrow bottom* case and a linear mass-balance, the AAR is around 0.6. In this case the total ice gain/loss at a certain height is not only determined by the distance away from the ELA but also from the width at a certain height (e.g. if the width 100 m above the ELA is double the width of 100 m below the ELA, so the total ice gain is double of the total ice loss at 100 m from the ELA). In this case the glacier length is longer compared with the case of constant width and in the lower altitudes the more negative mass-balance leads to more ice melt. Overall, the ablation area (area below ELA) stays smaller than the accumulation area, even with a longer glacier.
fr: Dans le cas d'un sommet large, d'une base étroite (*Wide top, narrow bottom*) et d'un bilan de masse linéaire, l'AAR est d'environ 0,6. Dans ce cas, le gain/la perte total de glace à une certaine hauteur n'est pas seulement déterminé par la distance par rapport à la ligne d'équilibre, mais aussi par la largeur à une cette même hauteur (par exemple, si la largeur 100 m au-dessus de la ELA est le double de la largeur 100 m sous la ELA, le gain total de glace est le double de la perte totale de glace à 100 m de la ELA). Dans ce cas, le glacier est plus long par rapport au cas où la largeur est constante, et dans les plus basses altitudes, le bilan de masse plus négatif entraîne une fonte de glace plus importante. Globalement, la zone d'ablation (zone sous la ELA) reste plus petite que la zone d'accumulation, même avec un glacier plus long.

source: For an advancing glacier with constant width the AAR-t is well above 0.5 (mass gain), and in the retreating case well below 0.5 (mass loss).
fr: Pour un glacier qui avance avec une largeur constante, l'AAR-t est bien supérieur à 0,5 (gain de masse). Dans le cas d'un recul, l'AAR-t est bien inférieur à 0,5 (perte de masse).

source: With a mass-balance gradient below the ELA twice the gradient above the ELA, the total ice loss is twice the total ice gain going the same distance away from the ELA. Therefore, the ablation area (area below the ELA) only needs to be half of the accumulation area at equilibrium. For the AAR-eq this means a value of approx. 0.6 (AAR = Ablation Area / Total Area = Ablation Area / (Accumulation Area + Ablation Area) = Ablation Area / (0.5 * Ablation Area + Ablation Area) = 1 / 1.5 = 2 / 3).
fr: Avec un gradient de bilan massique en sous la ELA deux fois supérieur au gradient au-dessus de la ELA, la perte totale de glace est deux fois plus importante que le gain total de glace à la même distance de la ELA. Par conséquent, la zone d'ablation (zone située sous la ELA) ne doit représenter que la moitié de la zone d'accumulation à l'équilibre. Cela conduit à un AAR-eq valant environ 0,6 (AAR = surface de la zone d'ablation / surface totale = surface de la zone d'ablation / (surface de la zone d'accumulation + surface de la zone d'ablation) = surface de la zone d'ablation / (0,5 * surface de la zone d'ablation + surface de la zone d'ablation) = 1 / 1,5 = 2 / 3).

source: For real glaciers in equilibrium with AAR between 0.5 and 0.8, we can assume wider tops and larger mass-balance gradients below the ELA.
fr: On peut supposer des vrais glaciers à l'équilibre ayant un AAR entre 0,5 et 0,8 qu'ils ont des sommets plus larges et des gradients de bilan de masse plus importants sous la ELA.

source: Balance Ratio, in the footsteps of a paleo-glaciologist
fr: le Ratio d'Equilibre ("Balance Ratio"), sur les traces d'un paléo-glaciologue

source: In this experiment we are using knowledge about Balance Ratios to estimate the height of the ELA (and past climate conditions). The Balance Ratio is defined as the ratio of the mass-balance gradient below the ELA to the mass-balance gradient above the ELA (e.g. *Mass-balance gradient below the ELA* = 4 and *Mass-balance gradient above the ELA* = 2 gives a Balance Ratio of 2). See `antarcticglaciers.org (mass-balance)`_ for an introduction about glacier mass-balance and the ELA, or our :ref:`glacier_basics` graphics for an illustration.
fr: Dans cette expérience, nous utilisons nos connaissances sur les ratios d'équilibre pour estimer l'altitude de la ligne d'équilibre (et les climats passés). Le ratio d'équilibre est défini comme le rapport entre le gradient du bilan massique sous la ELA par rapport au gradient du bilan massique au-dessus de la ELA (par exemple, *gradient du bilan massique en dessous de la ELA* = 4 et *gradient de bilan massique au-dessus de la ELA* = 2 donne un ratio d'équilibre de 2). Voir `antarcticglaciers.org (mass-balance)`_ pour une introduction au bilan de masse des glaciers et au concept de ligne d'équilibre (ELA), ou notre :ref:`glacier_basics`" pour une illustration.

source: In short: the height of the ELA is determined by temperature, among other things. In a warming climate, the ELA is increasing.
fr: En résumé : l'altitude de la ligne d'équilibre est déterminée par la température, entre autres facteurs. Dans un climat qui se réchauffe, la ELA augmente.

source: You made expeditions to the European Alps and Kamchatka to find two glacier areas of the last glaciological maximum, by using landmarks (e.g. abrasive erosion, moraines, ...). You want to use this information to approximate the ELA height and compare the past climates at these locations (note that this experiment is only fictional).
fr: Vous avez fait des expéditions dans les Alpes européennes et au Kamchatka pour trouver deux zones glaciaires datant du dernier maximum glaciologique, en utilisant différents indices et marqueurs (par exemple l'érosion abrasive, les moraines, ...). Vous voulez utiliser ces informations pour approximer l'altitude de la ligne d'équilibre et comparer les climats passés de ces deux endroits (notez que cette expérience est fictive).

source: For the European Alps glacier you found an approximated past area of 3 km². The glacier geometry is a *Linear* bedrock profile with a slope of 11° and *wide top, narrow bottom* width along the glacier (typical shape for a glacier).
fr: Pour le glacier des Alpes européennes, vous avez trouvé une superficie passée d'environ 3 km². Sa géométrie est la suivante : profil *linéaire* du socle rocheux, pente de 11° et glacier *large en haut, étroit en bas* (wide top, narrow bottom) (forme typique pour un glacier).

source: For the Kamchatka glacier the past area was also approx. 3 km². This glacier is *getting flatter* (bedrock profile) and *getting narrower* (width along glacier).
fr: Pour le glacier du Kamtchatka, l'ancienne superficie était également d'environ 3 km². Ce glacier est *de plus en plus plat* (profil du socle rocheux) et *de plus en plus étroit* (largeur du glacier).

source: You know that a typical Balance Ratio for the European Alps is around 1.5 and for the Kamchatka around 3 (e.g. `Rea, 2009 <https://www.sciencedirect.com/science/article/abs/pii/S0277379108002989?via%3Dihub>`_).
fr: Vous savez qu'un ratio d'équilibre typique pour les Alpes européennes vaut environ 1,5, contre environ 3 pour le Kamchatka (vous pouvez par exemple vous référer à `Rea, 2009 <https://www.sciencedirect.com/science/article/abs/pii/S0277379108002989?via%3Dihub>`_).

source: Use the simulator and change its parameters in a "try and error" approach to find the corresponding past ELAs.
fr: Utilisez le simulateur et changez ses paramètres en tâtonnant pour trouver les altitudes passées des lignes d'équilibre.

source: Which of the two glaciers was located in a warmer environment at that time?
fr: Lequel des deux glaciers était situé dans un environnement plus chaud à cette époque ?

source: How do different absolute values of the mass-balance gradients change your results?
fr: Comment les différentes valeurs des gradients de bilan de masse impactent-elles vos résultats ?

source: What additional information would be useful to know about our past glaciers in order to determine the absolute values of the mass-balance gradients?
fr: Quelles informations supplémentaires sur les glaciers du passé seraient utiles pour déterminer les valeurs du gradient de bilan massique ?

source: Using the correct Balance Ratios, we find the following ELAs: Alps ELA = 3100 m and Kamchatka ELA = 2000
fr: ELA des Alpes = 3100 m et ELA du Kamchatka = 2000m

source: From the ELA elevations, one can conclude that the past (fictional) climate in the Alps was warmer than in Kamchatka.
fr: A partir des altitudes des lignes d'équilibre, on peut conclure que le climat passé (fictif) des Alpes était plus chaud que celui du Kamchatka.

source: Different magnitudes of the mass-balance gradients do not change the results a lot, but they do affect the ice thickness.
fr: Les différentes valeurs des gradients de bilan de masse changent peu les résultats, mais ils affectent l'épaisseur de la glace.

source: Additional information about the maximum thickness could help to find the absolute gradient values.
fr: Des informations supplémentaires sur l'épaisseur maximale de glace pourraient aider à trouver les valeurs absolues des gradients.

source: Authors
fr: Auteurs

source: `Patrick Schmitt <https://github.com/pat-schmitt>`_ (main author) and `Fabien Maussion <https://fabienmaussion.info/>`_.
fr: `Patrick Schmitt <https://github.com/pat-schmitt>`_ (auteur principal) et `Fabien Maussion <https://fabienmaussion.info/>`_.

source: Source code
fr: Code source

source: Code and data are on `GitHub <https://github.com/OGGM/glacier_simulator>`_, BSD licensed.
fr: Le code et les données sont sur `GitHub <https://github.com/OGGM/glacier_simulator>`_, sous licence BSD.

source: Launching from Docker
fr: Lancement à partir de Docker

source: This application can keep a single processor quite busy when running. Fortunately, you can also start the app locally, which will make it faster and less dependent on an internet connection (although you still need one to download the app and display the logos).
fr: Cette application peut tenir un seul processeur assez occupé lorsqu'elle tourne. Heureusement, vous pouvez aussi lancer l'application en local, ce qui la rendra plus rapide et moins dépendante d'une connexion Internet (bien que vous en ayez toujours besoin pour télécharger l'application et afficher les logos).

source: To start the app locally, all you'll need is to have `Docker <https://www.docker.com/>`_ installed on your computer. From there, run this command into a terminal::
fr: Pour lancer l'application en local, il vous suffit d'avoir `Docker<https://www.docker.com/>`_ installé sur votre ordinateur. Exécutez alors cette commande dans un terminal :

source: Once running, you should be able to start the app in your browser at this address: `http://127.0.0.1:8080/ <http://127.0.0.1:8080/>`_.
fr: Une fois exécuté, vous devriez pouvoir démarrer l'application dans votre navigateur à cette adresse : `http://127.0.0.1:8080/ <http://127.0.0.1:8080/>`_.
