Repository: mathcret/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/simulator.po
Languages: fr

source: Glacier Simulator
fr: Simulateur de glacier

source: The glacier simulator is an **interactive web application** with which you can learn (and teach) about glacier flow, how glaciers grow and shrink, what glacier properties influence their size or velocity, and a lot more!
fr: Le simulateur de glacier est une **application web interactive** grâce à laquelle vous pouvez apprendre (et enseigner) des sujets comme l'écoulement des glaciers, la façon dont ils grandissent et rétrécissent, les propriétés qui influencent leur taille ou leur vitesse, et bien d'autres choses !

source: You can start the app by clicking on this link: |badge_bokeh_en|_
fr: Vous pouvez lancer l'application en cliquant sur ce lien : |badge_bokeh_en|_

source: The glacier simulator app runs a numerical glacier model in the background, using computer resources on the cloud. If several people are using the app at the same time, the server might become slow or unresponsive. In this case, we recommend to use the app `on MyBinder <https://mybinder.org/v2/gh/OGGM/glacier_simulator/stable?urlpath=panel/app>`_ or even locally on your own computer (see :ref:`docker-launch-simulator` below).
fr: L'application de simulation des glaciers fait tourner un modèle numérique de glacier en tâche de fond, ce qui utilise des ressources informatiques du cloud. Si plusieurs personnes utilisent l'application en même temps, le serveur peut devenir lent ou ne pas répondre. Dans ce cas, nous vous recommandons d'utiliser l'application `sur MyBinder <https://mybinder.org/v2/gh/OGGM/glacier_simulator/stable?urlpath=panel/app>`_ ou même en local sur votre propre ordinateur (voir :ref:`docker-launch-simulator` ci-dessous).

source: Getting started with the app
fr: Commencer avec l'application

source: The upper panel in the app is a guided tutorial about the app's functionalities. You can navigate it with the "Next" and "Previous" buttons, or use the "Find help here" overview.
fr: Le panneau supérieur de l'application est un tutoriel sur les différentes fonctionnalités de l'application. Vous pouvez y naviguer à l'aide des boutons "Suivant" et "Précédent ou utiliser l'aperçu "Trouver de l'aide ici".

source: Questions to explore with this app
fr: Questions à creuser avec cette application

source: With this app, you can address many questions, by yourself or in class! This list will grow in the future (documentation takes time!).
fr: Avec cette application, vous pouvez répondre à de nombreuses questions, seul ou en classe ! Cette liste va s'étoffer à l'avenir (la documentation prend du temps !).

source: Glacier shape
fr: La forme du glacier

source: See `antarcticglaciers.org (mass-balance)`_ for an introduction about glacier mass-balance and the ELA, or our :ref:`glacier_basics` graphics for an illustration.
fr: Consultez le site `antarcticglaciers.org (mass-balance)`_ pour avoir une introduction sur le bilan de masse des glaciers et sur la ligne d'équilibre (**ELA** pour equilibrium-line altitude), ou notre graphique :ref:`glacier_basics` pour avoir une illustration.

source: **Experiment:**
fr: **Expérience**

source: In "Beginner mode", start by setting the ELA to 3000m a.s.l, and note on a piece of paper: the equilibrium volume of the glacier, its length and maximal thickness.
fr: En mode "Débutant", commencez par fixer la ELA à 3000m d'altitude, et notez sur une feuille : le volume du glacier à l'équilibre, sa longueur et son épaisseur maximale.

source: Now choose the "wider top" glacier shape and run the model again.
fr: Choisissez maintenant la forme du glacier "sommet plus large" ("wider top") et relancez le modèle.

source: **Question to answer:**
fr: **Question**

source: Is the new glacier larger or smaller than before? Why?
fr: Le nouveau glacier est-il plus grand ou plus petit qu'avant ? Pourquoi ?

source: Take home messages
fr: Messages à retenir

source: A glacier with a wider top has a larger `accumulation area <https://en.wikipedia.org/wiki/Accumulation_zone>`_. It can therefore accumulate more mass (more ice) in the upper part. The glacier can flow further down until melt rates become large enough to compensate for this additional ice.
fr: Un glacier avec un sommet plus vaste a une plus grande `zone d'accumulation` <https://en.wikipedia.org/wiki/Accumulation_zone>`_. Il peut donc accumuler plus de masse (plus de glace) dans la partie supérieure. Le glacier peut s'écouler plus bas jusqu'à ce que les taux de fonte deviennent suffisamment importants pour compenser cette glace supplémentaire.

source: Take home messages (advanced)
fr: Messages à retenir (avancé)

source: An additional (and more advanced) observation can be done by looking at the "Accumulation Area Ratio" (AAR) of the two glaciers. In the "constant width" case, the glacier area is the same above and below the ELA (equilibrium AAR = 0.5, only true if the mass-balance gradient is also constant). In the "wider-top" case, the AAR at equilibrium is larger than 0.5: indeed, by flowing further down valley, the glacier is loosing more mass at its terminus than at its head, albeit over a different area (width). See our :ref:`glacier_aar` experiments to learn more about the AAR.
fr: Une observation supplémentaire (et plus poussée) peut être faite en regardant le "ratio de la surface d'accumulation" (AAR pour "Accumulation Area Ratio") des deux glaciers. Dans le cas où la largeur est constante, la surface du glacier est la même au-dessus et en dessous de la ELA (AAR à l'équilibre = 0,5 - uniquement vrai si le gradient du bilan de masse est également constant). Dans le cas où le sommet est plus large, le AAR à l'équilibre est supérieur à 0,5 : en effet, en s'écoulant plus bas dans la vallée, le glacier perd plus de masse à son extrémité qu'à sa tête, mais sur une surface (largeur) différente. Voir nos expériences :ref:`glacier_aar` pour en savoir plus sur l'AAR.

source: Equilibrium Line Altitude (ELA)
fr: Ligne d'équilibre (ELA pour Equilibrium Line Altitude)

source: We are going to show that the ELA is determinant in shaping glaciers.
fr: Nous allons montrer que la ELA est décisive dans la formation des glaciers.

source: In "Beginner mode", start by setting the ELA to 2500m a.s.l, and note on a piece of paper: the equilibrium volume of the glacier, its length and maximal thickness.
fr: En mode "Débutant", commencez par fixer la ELA à 2500m d'altitude, et notez sur une feuille : le volume du glacier à l'équilibre, sa longueur et son épaisseur maximale.

source: Now change the ELA up to 3500m a.s.l in 200m increments and, at each step, note the equilibrium volume of the glacier, its length and maximal thickness.
fr: Modifiez maintenant la ELA jusqu'à 3500 m d'altitude par paliers de 200 m et, à chaque étape, notez le volume du glacier à l'équilibre, sa longueur et son épaisseur maximale.

source: Next draw these variables on a graph, as a function of the ELA.
fr: Représentez ensuite ces variables sur un graphique, avec la ELA en ordonnée.

source: **Questions to answer:**
fr: **Questions**

source: How does glacier volume change with ELA? Can you explain why?
fr: Comment le volume des glaciers varie-t-il en fonction de la ELA ? Pouvez-vous expliquer pourquoi ?

source: What about glacier length and thickness?
fr: Qu'en est-il de la longueur et de l'épaisseur ?

source: Are these changes linear, or more complex?
fr: Ces variations sont elles linéaires ou plus complexes ?

source: An example graphic that students could come up with by varying the ELA with different shapes:
fr: Quelques exemples de grahiques que les étudiants peuvent construire en faisant varier la ELA avec les différentes formes :

source: **The lower the ELA, the larger the equilibrium glacier**. The length, volume or maximal thickness are not necessarily linear functions of the ELA: these depend on the physical relationships between ice flow and slope, as well as the feedback between glacier elevation and mass-balance.
fr: **Plus la ELA est basse, plus le glacier à l'équilibre est grand**. La longueur, le volume ou l'épaisseur maximale ne sont pas nécessairement des fonctions linéaires de la ELA : elles dépendent des relations physiques entre le flux de glace et la pente, ainsi que de la rétroaction entre l'altitude du glacier et le bilan de masse.

source: Glacier slope
fr: La pente du glacier

source: The slope of a glacier bed is one key ingredient which determines glacier flow. For an introduction, visit `antarcticglaciers.org (glacier-flow)`_. In short: glaciers flow downslope driven by the gravitational force. This force can be decomposed into an along-slope component and perpendicular to the slope component (see `this illustration in wikipedia <https://en.wikipedia.org/wiki/Inclined_plane#/media/File:Free_body1.3.svg>`_). The along-slope component "pulls" the glacier downwards and the perpendicular component "flattens" the glacier.
fr: La pente du lit d'un glacier est un élément clé qui détermine son écoulement. En guise d' introduction, visitez le site `antarcticglaciers.org (glacier-flow)`_. En deux mots : les glaciers s'écoulent vers l'aval sous l'effet de la force gravitationnelle. Cette force peut être décomposée en deux composantes : une le long de la pente et l'autre perpendiculaire à la pente (voir `cette illustration dans wikipedia <https://en.wikipedia.org/wiki/Inclined_plane#/media/File:Free_body1.3.svg>`_). La composante le long de la pente "tire" le glacier vers le bas et la composante perpendiculaire "aplatit" le glacier.

source: **Experiments:**
fr: **Expériences**

source: *Beginner*:
fr: *Débutant* :

source: Use beginner mode with standard settings (constant width, mass balance gradient of 4 and ELA of 3000) and run the model with all different settings for the slope and use the geometry plot for inspection.
fr: Utilisez le mode débutant avec des paramètres standard (largeur constante, gradient du bilan de masse égal à 4 et ELA à 3000m) et exécutez le modèle avec tous les paramètres possibles pour la pente. Utilisez les graphiques géométriques (onglet "geometry plot") pour garder le contrôle.

source: Take note on a piece of paper of the ice thickness, volume, area and length at the end of each model run.
fr: Notez sur une feuille l'épaisseur de la glace, le volume, la surface et longueur à la fin de chaque exécution du modèle.

source: *Advanced*:
fr: *Avancé*

source: Conduct the same experiment as for Beginner, but additionally take notes of the velocity and look how the parameters change with time in the timeseries plot.
fr: Faites la même expérience que celle proposée aux débutants en notant **la vitesse** en plus des autres paramètres, et regardez comment les paramètres changent avec le temps dans le le tracé de la série temporelle. (onglet "timeseries plot")

source: Which glaciers are thicker? Steep or flat ones? And why?
fr: Quels sont les glaciers les plus épais ? Ceux qui sont raides ou ceux qui sont plats ? Et pourquoi ?

source: Which glaciers are faster? Steep or flat ones? How and why does the velocity change with time?
fr: Quels sont les glaciers les plus rapides ? Ceux qui sont raides ou ceux qui sont plats ? Comment et pourquoi la vitesse change avec le temps ?

source: glaciers flow downslope under gravity
fr: les glaciers glissent vers l'aval sous l'effet de la gravité

source: the steeper the slope the thinner the glacier (larger along-slope gravitational force)
fr: Plus la pente est raide, plus le glacier est mince (la force gravitationnelle le long de la pente est plus importante)

source: the flatter the slope the larger the equilibrium velocity. When the glacier is thin (has not much mass) the along-slope component is more important. When the glacier is getting thicker the perpendicular component is getting more weight. This partly explains slower velocities for flatter slopes at the start of the model run, and higher velocities when the glacier is getting thicker. For steeper slopes the velocities at the start are large and so more ice is transported downwards, and the glacier stays relatively thin.
fr: Plus la pente est faible, plus la vitesse à l'équilibre est élevée". Lorsque le glacier est mince (i.e. n'a pas beaucoup de masse), la composante le long de la pente est plus importante. Lorsque le glacier s'épaissit, c'est la composante perpendiculaire qui prend plus de poids. Cela explique en partie les vitesses plus lentes pour des pentes plus plates au début de l'exécution du modèle, et des vitesses plus élevées à mesure que le glacier s'épaissit. Pour les pentes plus raides, les vitesses de départ sont élevées et plus de glace est donc transportée vers le bas, c'est pourquoi le glacier reste relativement mince.

source: Some of the world's glaciers experience "surges" during which they flow much faster than usual and can advance dramatically. For an introduction see `antarcticglaciers.org (surging-glaciers)`_ , or `this video`_ of surging Karakorum glaciers seen from space.
fr: Certains glaciers connaissent des "surges" (terme anglais que l'on peut traduire approximativement par "emballements", "déferelements", "poussées" ou plus difficilement "crues") pendant lesquelles ils s'écoulent beaucoup plus vite que d'habitude et peuvent avancer de façon spectaculaire. Pour une introduction, voir `antarcticglaciers.org (surging-glaciers)`_ , ou `cette video`_ de glaciers du Karakoram en pleine expansion vus de l'espace.

source: We will use the simulator app to explore the characteristics of a surging glacier.
fr: Nous allons utiliser le simulateur pour explorer les caractéristiques d'un "surging glacier".

source: Use the "beginner mode" with standard settings (constant width, mass balance gradient of 4 and ELA of 3000) and run the model to create a glacier in equilibrium.
fr: Utilisez le "mode débutant" avec des paramètres standard (largeur constante, gradient du bilan de masse égal à 4 et ELA à 3000m) et exécutez le modèle pour créer un glacier à l'équilibre.

source: This glacier should now experience a surge which lasts for ten years: Switch into the "advanced mode". Turn on "sliding", i.e. the glacier will "slip" on the bedrock, and let the model advance for 10 years.
fr: Ce glacier devrait maintenant connaître une "surge" qui dure dix ans : Passez en "mode avancé". Activez le "glissement" ("sliding"), c'est-à-dire que le glacier "glissera" sur le socle rocheux, et laissez le modèle avancer pendant 10 ans.

source: Between surge events long periods of quiescence happen: simulate one by advancing your glacier without sliding for 100 years.
fr: Entre les "surges", de longues périodes de calme se passent : simulez-en une en faisant évoluer votre glacier sans glissement pendant 100 ans.

source: Repeat the surge event and the period of quiescence. Use the timeseries plots and the timeseries options to show the maximum velocity as well as the maximum thickness.
fr: Répétez l'événement de "surge" et la période de quiescence. Utilisez les séries temporelles (timeseries plot) et leurs options pour afficher la vitesse maximale ainsi que l'épaisseur maximale.

source: *Beginner:*
fr: *Débutant*

source: During a surge event: How much faster is the glacier during a surge in comparison to a "normal" (quiescence) period? How much gains the glacier in length?
fr: Pendant un événement de "surge" : à quel point le glacier est il plus rapide par rapport à une période "normale" (quiescence) ? Combien de mètres de longueur le glacier gagne-t-il ?

source: After a surge event: How can you explain the glacier retreat?
fr: Après un évènement de "surge" : comment expliquer le retrait du glacier ?

source: *Advanced:*
fr: *Avancé*

source: Why is the glacier thinning during a surge?
fr: Pourquoi le glacier s'amincit-il pendant une "surge" ?

source: How can you explain the opposing behaviours of length and volume during a surge?
fr: Comment pouvez-vous expliquer les comportements antagonistes de la longueur et du volume pendant une "surge" ?

source: Why is the glacier thickening after the surge?
fr: Pourquoi le glacier s'épaissit-il après la "surge" ?

source: During a surge event: The glacier flows faster and reaches lower in the valley. In the upper parts the accumulation of snow does change, but not much (accumulation is slightly less since the glacier is thinner: a process called mass-balance / elevation feedback). At the same time, a much larger area than usual of the glacier is exposed to melt below the ELA. Therefore the glacier thins and looses volume, although it is still advancing.
fr: Lors d'un événement de "surge" : Le glacier s'écoule plus rapidement et descend plus bas dans la vallée. Dans les parties supérieures, l'accumulation de neige change, mais peu (l'accumulation est légèrement inférieure puisque le glacier est plus fin : un processus appelé rétroaction bilan de masse / altitude). Dans le même temps, une zone beaucoup plus importante que d'habitude du glacier est exposée à la fonte sous la ELA. Par conséquent, le glacier s'amincit et perd du volume, bien qu'il progresse toujours.

source: After a surge event: The glacier flow recovers its usual "slow" velocity. The glacier will retreat until it accumulated enough ice to advance again.
fr: Après une évènement de "surge" : L'écoulement du glacier retrouve sa "faible" vitesse habituelle. Le front du glacier reculera jusqu'à ce que le glacier ait accumulé assez de glace pour avancer à nouveau.

source: **Going further:**
fr: **Pour aller plus loin**

source: In the notebook `surging glaciers <https://oggm.org/oggm-edu-notebooks/oggm-edu/surging_experiment.html>`_ you can use OGGM to simulate surging events in Python yourself.
fr: Dans le notebook `surging glaciers <https://oggm.org/oggm-edu-notebooks/oggm-edu/surging_experiment.html>`_ vous pouvez utiliser OGGM pour simuler des événements de "surge" par vous-même en Python.

source: Velocity and thickness along the glacier
fr: Vitesse et épaisseur le long du glacier

source: Use "Beginner mode" to simulate a glacier in equilibrium with *Width* = *Constant*, *ELA* = 3000, *Mass-balance gradient* = 4 and *Slope* = 11°.
fr: Utilisez le "mode débutant" pour simuler un glacier à l'équilibre avec *Width* = *Constant*, *ELA* = 3000, *Mass-balance gradient* = 4 and *Slope* = 11°.

source: Use "Beginner mode" to simulate a glacier with *Width* = *Wide top, narrow bottom*, *ELA* = 3500, *Mass-balance gradient* = 4 and *Slope* = 11°.
fr: Utilisez le "mode débutant" pour simuler un glacier avec *Width* = *Wide top, narrow bottom*, *ELA* = 3500, *Mass-balance gradient* = 4 and *Slope* = 11°.

source: Make a guess as to where the ice velocity along the glacier is largest?
fr: Devinez où la vitesse de la glace est la plus importante.

source: When you made your guess, go to "Geometry opt." and tick the box *Ice velocity (top left)* and *Ice thickness (bottom left)*. Now the red/blue colors are showing the velocity/thickness distribution along the glacier. Did you guess correctly?
fr: Quand vous avez fait votre choix, allez dans "Geometry opt." et cochez la case *Ice velocity (en haut à gauche)* et *Ice thickness (en bas à gauche)*. Les couleurs rouge/bleu indiquent la distribution du ratio vitesse/épaisseur le long du glacier. Aviez-vous deviné correctement ?

source: What is the influence of the glacier bed bottleneck (narrowing) on ice thickness and velocity? Why?
fr: Quelle est l'influence du rétrécissement (goulot d'étranglement) du lit du glacier sur l'épaisseur et la vitesse de la glace ? Pourquoi ?

source: mass is accumulated from the top of the glacier down to the ELA (areas of positive mass-balance): all this mass must be transported downwards, and so the ice flux at equilibrium is largest at the ELA. Larger ice flux means thicker ice and faster glacier flow.
fr: la masse s'accumule du sommet du glacier jusqu'à la ELA (zone où le bilan de masse est positif) : toute cette masse doit être transportée vers le bas. C'est pouquoi, à l'équilibre, le flux de glace plus important au niveau de la ELA. Un flux de glace plus important signifie une plus grande épaisseur de glace et un écoulement plus rapide du glacier.

source: below the ELA, mass is constantly ablated and the ice flux decreases: lower ice flux means thinner ice and reduced glacier flow velocity.
fr: Sous la ELA, la masse est constamment ablatée et le flux de glace diminue : un flux de glace plus faible signifie une moindre épaisseur de glace et une vitesse d'écoulement du glacier réduite.

source: a narrowing of glacier widths means that the same amount of ice needs to be transported through a smaller door: this means that we have both the creation of a "traffic jam" (thickening) and an increase of ice velocity in order to transport more mass downwards.
fr: un lit de glacier plus étroit signifie que la même quantité de glace doit être transportée via une plus petite porte : cela signifie que nous avons à la fois la création d'un "embouteillage" (épaississement) et une augmentation de la vitesse de la glace afin de transporter plus de masse vers le bas.

source: in this case, the maximum velocity is no longer located around the ELA but further down (at the bottleneck)
fr: dans ce cas, la zone de plus grande vitesse ne se trouve pas au niveau de la ligne d'équilibre, mais plus bas (au niveau du verrou)

source: Mass-balance gradient
fr: Gradient de bilan de masse

source: See `antarcticglaciers.org (mass-balance)`_ for an introduction about glacier mass-balance and the mass-balance gradient.
fr: Voir `antarcticglaciers.org (mass-balance)`_ pour une introduction au bilan de masse des glaciers et gradient de bilan de masse.

source: In short: The climatic regime determines the glacier mass-balance gradient. Discovering global glacier locations using the :ref:`explorer` reveals that glaciers can be found in quite different climates around the world. Here, we will now discover how different mass-balance gradients are shaping glaciers.
fr: En bref : le régime climatique détermine le gradient de bilan de masse des glaciers. En parcourant l'emplacement des glaciers à l'échelle du monde avec le :ref:`explorer`, on voit que les glaciers peuvent se trouver dans des climats très différents partout dans le monde. Ici, nous allons découvrir comment des gradients de bilan de masse différents façonnent les glaciers.

source: First, simulate a glacier in a maritime climate in temperate latitudes (larger mass-balance gradient, e.g. 10). For this, use the "Beginner mode" (*ELA* = 3000, *Width* = *Constant* and *Slope* = 11°) and let the glacier grow until it reaches equilibrium and note on a piece of paper: the equilibrium *Time*, *Length*, *Area*, *Volume*, *Max ice thickness* and *Max ice velocity* of the glacier.
fr: Commencez par simuler un glacier dans un climat maritime sous des latitudes tempérées (fort gradient de bilan de masse, par exemple 10). Pour cela, utilisez le mode "Débutant" (*ELA* = 3000, *Width* = *Constant* et *Pente* = 11°) et laissez le glacier grandir jusqu'à ce qu'il atteigne l'équilibre. Notez alors sur une feuille : le *Temps* écoulé, ainsi la *Longueur*, la *Superficie*, le *Volume*, l'*Épaisseur maximale de la glace* et la *Vitesse maximale de la glace* du glacier à l'équilibre.

source: Next, simulate a glacier in a continental climate in polar latitudes (smaller Mass Balance gradient, e.g. 3) and take some notes again.
fr: Ensuite, simulez un glacier dans un climat continental sous des latitudes polaires (gradient de bilan de masse plus faible, par exemple 3) et prenez à nouveau des notes.

source: Which of the two glaciers (maritime or continental) is thicker (*Max ice thickness*)?
fr: Lequel des deux glaciers (maritime ou continental) est le plus épais ? (*Max ice thickness*)

source: Which is flowing faster (*Max ice velocity*)?
fr: Lequel s'écoule le plus vite ? (*Max ice velocity*)
