Repository: mathcret/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/technical_details.po
Languages: fr

source: Technical details
fr: Détails techniques

source: We provide more information about the platform's internals for instructors and contributors. Make sure you read :ref:`notebooks_howto` before going on!
fr: Nous donnons plus d'informations sur les mécanismes internes de la plateforme à destination des formateurs et des contributeurs. Assurez-vous de lire :ref:`notebooks_howto` avant de vous lancer !

source: The computing environments
fr: Les environnements informatiques

source: The computing environments available via MyBinder are `Docker containers <https://www.docker.com/resources/what-container>`_, or "software capsules" that can be created, pushed and pulled online. We create these containers using a few simple configuration files specifying the software packages and python libraries we would like to used in OGGM-Edu. These configurations files are found in this repository: `<https://github.com/OGGM/binder>`_
fr: Les environnements informatiques disponibles via MyBinder sont des `Docker containers <https://www.docker.com/resources/what-container>`_, ou des "softwarecapsules" qui peuvent être créés et manipulés en ligne. Nous créons ces containers en utilisant quelques fichiers de paramétrage simples spécifiant les packages et les bibliothèques python que nous souhaitons utiliser dans OGGM-Edu. Ces fichiers de paramétrage se trouvent dans ce répertoire : `<https://github.com/OGGM/binder>`_

source: MyBinder uses `repo2docker <https://repo2docker.readthedocs.io>`_ to build these environments and stores them in a hidden database. Once built, they won't be built again unless a new change is made to the ``OGGM/binder`` repository.
fr: MyBinder utilise `repo2docker <https://repo2docker.readthedocs.io>`_ pour construire ces environnements et les stocker dans une base de données cachée. Une fois construits, ils ne seront plus construits à nouveau à moins qu'une modification soit apportée au répertoire ``OGGM/binder``.

source: We use the same principle to build images that can be used by your own JupyterHub deployment, if you have one. These images are available `here <https://hub.docker.com/r/oggm/r2d>`_ and form the base of the Binder environments. Their configuration files are found in this repository: `<https://github.com/OGGM/r2d>`_. We use these in :ref:`oggm_hub`.
fr: Nous utilisons le même principe pour construire des images qui peuvent être utilisées par votre propre affectation JupyterHub, si vous en avez une. Ces images sont disponibles `ici <https://hub.docker.com/r/oggm/r2d>`_ et forment la base des environnements Binder.Leurs fichiers de paramétrage se trouvent dans ce répertoire : `<https://github.com/OGGM/r2d>`_. Nous les utilisons dans :ref:`oggm_hub`.

source: The notebooks
fr: Les notebooks

source: The notebooks are developped collaboratively. We welcome your input and contributions! You will find the directory with all notebooks (educational and tutorials) on GitHub: `<https://github.com/OGGM/oggm-edu-notebooks>`_
fr: Les notebooks sont développés de manière collaborative. Vos commentaires et contributions sont les bienvenus ! Vous trouverez le répertoire avec tous les notebooks (éducatifs et didacticiels) sur GitHub : `<https://github.com/OGGM/oggm-edu-notebooks>`_

source: This website
fr: Ce site web

source: The content of this website is written within the `Sphinx <http://sphinx-doc.org/>`_ framework and is hosted on `ReadTheDocs <https://readthedocs.org>`_.
fr: Le contenu de ce site est écrit avec l'ossature `Sphinx <http://sphinx-doc.org/>`_ et est hébergé sur `ReadTheDocs <https://readthedocs.org>`_.

source: We also provide a dedicated OGGM JupyterLab running on our own server: `OGGM-Hub <https://docs.oggm.org/en/stable/cloud.html#oggm-hub>`_. The advantages of OGGM-Hub over Binder are:
fr: Nous fournissons également un JupyterLab dédié à OGGM fonctionnant sur notre propre serveur : `OGGM-Hub <https://docs.oggm.org/en/stable/cloud.html#oggm-hub>`_. Les avantages de OGGM-Hub par rapport à Binder sont :

source: more resources for your students, faster launches
fr: plus de ressources pour vos étudiants, des lancements plus rapides

source: user management: you can set passwords and user names at wish
fr: gestion des comptes : vous pouvez définir des mots de passe et des noms d'utilisateur sur demande

source: persistent sessions: work can be saved between sessions and log-ins (this is probably the main advantage of OGGM-Hub)
fr: sessions permanentes : le travail peut être sauvegardé d'une session à l'autre (c'est probablement le principal avantage d'OGGM-Hub)

source: `hub.oggm.org <https://hub.oggm.org>`_ is only available to registered users (registration is free!), but it won't work for an entire class. If you have a specific need for an OGGM-hub service (e.g. for a one-week class or a workshop), please :ref:`title_contact` and we'll try to arrange a specific set-up for you!
fr: `hub.oggm.org <https://hub.oggm.org>`_ n'est disponible que pour les utilisateurs enregistrés (l'inscription est gratuite !), mais il ne fonctionnera pas pour une classe entière. Si vous avez un besoin spécifique d'un service OGGM-hub (par exemple pour un cours d'une semaine ou un atelier), veuillez :ref:`title_contact` et nous essaierons d'aménager une installation spécifique pour vous !
