Repository: mathcret/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/user_content.po
Languages: fr

source: Use your own notebooks with OGGM-Edu
fr: Utilisez votre propre notebook avec OGGM-Edu

source: You might be interested in running your own notebooks in an OGGM-Edu environment, for example during the development phase or for a class you are giving.
fr: Vous pourriez vouloir exécuter vos propres notebooks dans un environnement OGGM-Edu, par exemple pendant la phase de développement ou pour un cours que vous donnez.

source: Fortunately, this is very easy to do! All you need to do is to provide the notebooks you would like to run in an online git repository (e.g. GitHub, Gitlab, Bitbucket). For example, we have created an `oggm-edu-contrib <https://github.com/OGGM/oggm-edu-contrib>`_ with one single notebook to get you started. See also :ref:`examples` for existing classes making use of this system.
fr: Par chance, c'est très facile à faire ! Vous avez juste à placer les notebooks que vous souhaitez exécuter dans un dépôt git en ligne (GitHub, Gitlab, Bitbucket,...). Pour donner l'exemple, nous avons créé un " `oggm-edu-contrib <https://github.com/OGGM/oggm-edu-contrib>`_ avec un seul notebook pour vous aider à démarrer. Voir aussi :ref:`examples` pour les cours existantes faisant appel à ce système.

source: Ideally, we would like all OGGM-Edu related content to be bundled here on this open platform: if you feel comfortable sharing your content to others, please let us know!
fr: Idéalement, nous aimerions que tout le contenu lié à OGGM-Edu soit regroupé ici sur cette plateforme ouverte : si vous vous sentez à l'aise avec le fait que votre contenu soit partagé avec d'autres, faites-le nous savoir !

source: On MyBinder
fr: Sur MyBinder

source: Using your own notebooks in an OGGM-Edu Binder environment is super easy! Once your notebooks are online, you simply have to provide the correct link to your students. The syntax is following::
fr: Utiliser ses propres notebooks dans un environnement OGGM-Edu Binder est très facile ! Une fois que vos notebooks sont en ligne, il vous suffit de fournir le bon lien à vos étudiants. La syntaxe est la suivante :

source: For example, a link to our contrib repository looks like:
fr: Par exemple, un lien vers notre dépôt contributif ressemble à :

source: What is happening here? The first part of the link (up to the question mark) is telling MyBinder to use the OGGM environment we are maintaining `here <https://github.com/OGGM/binder>`_ (we use the stable branch here). The second part of the link is using `nbgitpuller <https://jupyterhub.github.io/nbgitpuller/>`_ to fetch the provided online repository and its content. That's all!
fr: Qu'est-ce qui se passe ici ? La première partie du lien (jusqu'au point d'interrogation) dit à MyBinder d'utiliser l'environnement OGGM que nous entretenons `ici <https://github.com/OGGM/binder>`_ (nous utilisons la version stable ici). La deuxième partie du lien utilise `nbgitpuller <https://jupyterhub.github.io/nbgitpuller/>`_ pour récupérer le dépôt en ligne préalablement fourni et son contenu. C'est tout !

source: This was the most basic example. If you want to use other features, like using the Jupyter Lab interface (instead of the simple notebooks interface), and if you want to start at an arbitrary location in the repository (for example within a folder), the syntax is a bit more clumsy. The best way (by far!) is to rely on nbgitpuller's `link generator <https://jupyterhub.github.io/nbgitpuller/link.html>`_ to do the job for you.
fr: C'était l'exemple le plus basique. Si vous souhaitez utiliser d'autres fonctionnalités, comme l'utilisation de l'interface Jupyter Lab (au lieu de la simple interface notebooks), et si vous voulez commencer à l'endroit de votre choix dans le répertoire (par exemple dans un dossier), la syntaxe est un peu plus lourde. La meilleure façon (de loin !) est de compter sur le `lien du générateur nbgitpuller <https://jupyterhub.github.io/nbgitpuller/link.html>`_ pour faire le travail à votre place.

source: For example, we start the OGGM-Edu tutorials with this link:
fr: A titre d'exemple, nous lançons les tutoriels OGGM-Edu avec ce lien :

source: It's getting quite long, I know! What's best therefore is to hide the links `behind a badge <https://mybinder.readthedocs.io/en/latest/howto/badges.html>`_.
fr: Ça devient assez long, je sais ! Le mieux est donc de cacher les liens `derrière un badge <https://mybinder.readthedocs.io/en/latest/howto/badges.html>`_.

source: If you are creating educational resources based on OGGM-Edu, please :ref:`get in touch <title_contact>` so that we can advertise them!
fr: Si vous créez des ressources éducatives basées sur OGGM-Edu, veuillez :ref:`nous contacter <title_contact>` afin que nous puissions les promouvoir !
